## S07-L002 - metody append i concat

In [1]:
import numpy as np
import pandas as pd

In [2]:
mrbean = pd.read_csv('course-files/mrbean_facebook_statuses_join.csv',\
                     usecols=['status_message_mrbean','status_type','num_likes'])

In [3]:
nasa = pd.read_csv('course-files/nasa_facebook_statuses_join.csv',\
                   usecols=['status_message_nasa','status_type','num_likes'])

In [4]:
mrbean.head()

                               status_message_mrbean status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079
1                                                NaN       photo     114008
2                                                NaN       photo     218579
3  Mr Bean is ready to do some shopping but bewar...       video      20338
4                                                NaN       photo     215591

In [5]:
nasa.head()

                                 status_message_nasa status_type  num_likes
0  This morning, the #RockOn mission with student...       photo       5142
1  Pluto's largest moon, Charon, is home to an un...       photo      19074
2  Our Restore-L mission is an endeavor to launch...       photo       7551
3  A new dark vortex was discovered in the atmosp...       photo      24359
4                                                NaN       video       2731

In [13]:
fb = mrbean.append(nasa, sort=True, ignore_index=True)

In [14]:
fb.head()

,num_likes,status_message_mrbean,status_message_nasa,status_type
0,16079,It's time for Mr Bean and Teddy to get ready f...,NaN,video
1,114008,NaN,NaN,photo
2,218579,NaN,NaN,photo
3,20338,Mr Bean is ready to do some shopping but bewar...,NaN,video
4,215591,NaN,NaN,photo

In [15]:
fb.tail()

,num_likes,status_message_mrbean,status_message_nasa,status_type
814,39355,NaN,You've never seen Pluto like this before! New ...,photo
815,11835,NaN,Our cooperative field study in East Asia advan...,photo
816,15567,NaN,"After spending a #YearInSpace, astronaut Scott...",photo
817,41584,NaN,"Gravitational waves, predicted by Einstein and...",photo
818,12793,NaN,Have you ever used a GPS to help you get somew...,photo

In [16]:
fb.loc[0]

num_likes                                                            16079
status_message_mrbean    It's time for Mr Bean and Teddy to get ready f...
status_message_nasa                                                    NaN
status_type                                                          video
Name: 0, dtype: object

In [19]:
mrbean.rename({'status_message_mrbean': 'status_message'}, inplace=True, axis=1)

In [20]:
mrbean.head()

                                      status_message status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079
1                                                NaN       photo     114008
2                                                NaN       photo     218579
3  Mr Bean is ready to do some shopping but bewar...       video      20338
4                                                NaN       photo     215591

In [21]:
nasa.rename({'status_message_nasa':'status_message'}, inplace=True, axis=1)

In [23]:
fb = mrbean.append(nasa, ignore_index=True, sort=True)

In [24]:
fb = pd.concat([mrbean, nasa], sort=True, ignore_index=True)

In [25]:
fb.head()

   num_likes                                     status_message status_type
0      16079  It's time for Mr Bean and Teddy to get ready f...       video
1     114008                                                NaN       photo
2     218579                                                NaN       photo
3      20338  Mr Bean is ready to do some shopping but bewar...       video
4     215591                                                NaN       photo

In [26]:
fb.tail()

     num_likes                                     status_message status_type
814      39355  You've never seen Pluto like this before! New ...       photo
815      11835  Our cooperative field study in East Asia advan...       photo
816      15567  After spending a #YearInSpace, astronaut Scott...       photo
817      41584  Gravitational waves, predicted by Einstein and...       photo
818      12793  Have you ever used a GPS to help you get somew...       photo